home = ["Телятников", "Шляхтенко", "Каратаева", "Шароглазов", "Шалин",
        "Кузнецов", "Малофеев", "Новиков", "Михалков", "Черепаха"]
guest = ["Смирнов", "Шалин", "Мачтаков", "Шнуров", "Овчиников",
         "Миронов", "Иванов", "Степанов", "Кузьменко", "Машков"]
sport_team = ("Телятников", "Каратаева","Смирнов","Машков","Кузнецов"
              ,"Миронов","Иванов","Новиков","Черепаха","Кузьменко")
print(home)
print(guest) 
print(sport_team)

c=len(sport_team)

print (f"Список из спортивной команды включает {c} человек")

abc = tuple(sorted(sport_team))
print ('Список членов команды по алфовиту: ')
print (abc)

i= abc.count("Иванов")
if i == 0:
    print("В спортивной команде нет Ивановых")
else:
    print(f"В спортивной команде есть Ивановы. Их количество: {i}")